GopalSaraf/Practicals/PSDL/include/proc/pic16lf722a.inc
// Register: IOCB
#define IOCB IOCB
IOCB                                     equ 0096h
// bitfield definitions
IOCB_IOCB_POSN                           equ 0000h
IOCB_IOCB_POSITION                       equ 0000h
IOCB_IOCB_SIZE                           equ 0008h
IOCB_IOCB_LENGTH                         equ 0008h
IOCB_IOCB_MASK                           equ 00FFh
IOCB_IOCB0_POSN                          equ 0000h
IOCB_IOCB0_POSITION                      equ 0000h
IOCB_IOCB0_SIZE                          equ 0001h
IOCB_IOCB0_LENGTH                        equ 0001h
IOCB_IOCB0_MASK                          equ 0001h
IOCB_IOCB1_POSN                          equ 0001h
IOCB_IOCB1_POSITION                      equ 0001h
IOCB_IOCB1_SIZE                          equ 0001h
IOCB_IOCB1_LENGTH                        equ 0001h
IOCB_IOCB1_MASK                          equ 0002h
IOCB_IOCB2_POSN                          equ 0002h
IOCB_IOCB2_POSITION                      equ 0002h
IOCB_IOCB2_SIZE                          equ 0001h
IOCB_IOCB2_LENGTH                        equ 0001h
IOCB_IOCB2_MASK                          equ 0004h
IOCB_IOCB3_POSN                          equ 0003h
IOCB_IOCB3_POSITION                      equ 0003h
IOCB_IOCB3_SIZE                          equ 0001h
IOCB_IOCB3_LENGTH                        equ 0001h
IOCB_IOCB3_MASK                          equ 0008h
IOCB_IOCB4_POSN                          equ 0004h
IOCB_IOCB4_POSITION                      equ 0004h
IOCB_IOCB4_SIZE                          equ 0001h
IOCB_IOCB4_LENGTH                        equ 0001h
IOCB_IOCB4_MASK                          equ 0010h
IOCB_IOCB5_POSN                          equ 0005h
IOCB_IOCB5_POSITION                      equ 0005h
IOCB_IOCB5_SIZE                          equ 0001h
IOCB_IOCB5_LENGTH                        equ 0001h
IOCB_IOCB5_MASK                          equ 0020h
IOCB_IOCB6_POSN                          equ 0006h
IOCB_IOCB6_POSITION                      equ 0006h
IOCB_IOCB6_SIZE                          equ 0001h
IOCB_IOCB6_LENGTH                        equ 0001h
IOCB_IOCB6_MASK                          equ 0040h
IOCB_IOCB7_POSN                          equ 0007h
IOCB_IOCB7_POSITION                      equ 0007h
IOCB_IOCB7_SIZE                          equ 0001h
IOCB_IOCB7_LENGTH                        equ 0001h
IOCB_IOCB7_MASK                          equ 0080h
IOCB_IOC0_POSN                           equ 0000h
IOCB_IOC0_POSITION                       equ 0000h
IOCB_IOC0_SIZE                           equ 0001h
IOCB_IOC0_LENGTH                         equ 0001h
IOCB_IOC0_MASK                           equ 0001h
IOCB_IOC1_POSN                           equ 0001h
IOCB_IOC1_POSITION                       equ 0001h
IOCB_IOC1_SIZE                           equ 0001h
IOCB_IOC1_LENGTH                         equ 0001h
IOCB_IOC1_MASK                           equ 0002h
IOCB_IOC2_POSN                           equ 0002h
IOCB_IOC2_POSITION                       equ 0002h
IOCB_IOC2_SIZE                           equ 0001h
IOCB_IOC2_LENGTH                         equ 0001h
IOCB_IOC2_MASK                           equ 0004h
IOCB_IOC3_POSN                           equ 0003h
IOCB_IOC3_POSITION                       equ 0003h
IOCB_IOC3_SIZE                           equ 0001h
IOCB_IOC3_LENGTH                         equ 0001h
IOCB_IOC3_MASK                           equ 0008h
IOCB_IOC4_POSN                           equ 0004h
IOCB_IOC4_POSITION                       equ 0004h
IOCB_IOC4_SIZE                           equ 0001h
IOCB_IOC4_LENGTH                         equ 0001h
IOCB_IOC4_MASK                           equ 0010h
IOCB_IOC5_POSN                           equ 0005h
IOCB_IOC5_POSITION                       equ 0005h
IOCB_IOC5_SIZE                           equ 0001h
IOCB_IOC5_LENGTH                         equ 0001h
IOCB_IOC5_MASK                           equ 0020h
IOCB_IOC6_POSN                           equ 0006h
IOCB_IOC6_POSITION                       equ 0006h
IOCB_IOC6_SIZE                           equ 0001h
IOCB_IOC6_LENGTH                         equ 0001h
IOCB_IOC6_MASK                           equ 0040h
IOCB_IOC7_POSN                           equ 0007h
IOCB_IOC7_POSITION                       equ 0007h
IOCB_IOC7_SIZE                           equ 0001h
IOCB_IOC7_LENGTH                         equ 0001h
IOCB_IOC7_MASK                           equ 0080h

// Register: TXSTA
#define TXSTA TXSTA
TXSTA                                    equ 0098h
// bitfield definitions
TXSTA_TX9D_POSN                          equ 0000h
TXSTA_TX9D_POSITION                      equ 0000h
TXSTA_TX9D_SIZE                          equ 0001h
TXSTA_TX9D_LENGTH                        equ 0001h
TXSTA_TX9D_MASK                          equ 0001h
TXSTA_TRMT_POSN                          equ 0001h
TXSTA_TRMT_POSITION                      equ 0001h
TXSTA_TRMT_SIZE                          equ 0001h
TXSTA_TRMT_LENGTH                        equ 0001h
TXSTA_TRMT_MASK                          equ 0002h
TXSTA_BRGH_POSN                          equ 0002h
TXSTA_BRGH_POSITION                      equ 0002h
TXSTA_BRGH_SIZE                          equ 0001h
TXSTA_BRGH_LENGTH                        equ 0001h
TXSTA_BRGH_MASK                          equ 0004h
TXSTA_SYNC_POSN                          equ 0004h
TXSTA_SYNC_POSITION                      equ 0004h
TXSTA_SYNC_SIZE                          equ 0001h
TXSTA_SYNC_LENGTH                        equ 0001h
TXSTA_SYNC_MASK                          equ 0010h
TXSTA_TXEN_POSN                          equ 0005h
TXSTA_TXEN_POSITION                      equ 0005h
TXSTA_TXEN_SIZE                          equ 0001h
TXSTA_TXEN_LENGTH                        equ 0001h
TXSTA_TXEN_MASK                          equ 0020h
TXSTA_TX9_POSN                           equ 0006h
TXSTA_TX9_POSITION                       equ 0006h
TXSTA_TX9_SIZE                           equ 0001h
TXSTA_TX9_LENGTH                         equ 0001h
TXSTA_TX9_MASK                           equ 0040h
TXSTA_CSRC_POSN                          equ 0007h
TXSTA_CSRC_POSITION                      equ 0007h
TXSTA_CSRC_SIZE                          equ 0001h
TXSTA_CSRC_LENGTH                        equ 0001h
TXSTA_CSRC_MASK                          equ 0080h
TXSTA_TXD8_POSN                          equ 0000h
TXSTA_TXD8_POSITION                      equ 0000h
TXSTA_TXD8_SIZE                          equ 0001h
TXSTA_TXD8_LENGTH                        equ 0001h
TXSTA_TXD8_MASK                          equ 0001h
TXSTA_nTX8_POSN                          equ 0006h
TXSTA_nTX8_POSITION                      equ 0006h
TXSTA_nTX8_SIZE                          equ 0001h
TXSTA_nTX8_LENGTH                        equ 0001h
TXSTA_nTX8_MASK                          equ 0040h
TXSTA_TX8_9_POSN                         equ 0006h
TXSTA_TX8_9_POSITION                     equ 0006h
TXSTA_TX8_9_SIZE                         equ 0001h
TXSTA_TX8_9_LENGTH                       equ 0001h
TXSTA_TX8_9_MASK                         equ 0040h

// Register: SPBRG
#define SPBRG SPBRG
SPBRG                                    equ 0099h
// bitfield definitions
SPBRG_BRG0_POSN                          equ 0000h
SPBRG_BRG0_POSITION                      equ 0000h
SPBRG_BRG0_SIZE                          equ 0001h
SPBRG_BRG0_LENGTH                        equ 0001h
SPBRG_BRG0_MASK                          equ 0001h
SPBRG_BRG1_POSN                          equ 0001h
SPBRG_BRG1_POSITION                      equ 0001h
SPBRG_BRG1_SIZE                          equ 0001h
SPBRG_BRG1_LENGTH                        equ 0001h
SPBRG_BRG1_MASK                          equ 0002h
SPBRG_BRG2_POSN                          equ 0002h
SPBRG_BRG2_POSITION                      equ 0002h
SPBRG_BRG2_SIZE                          equ 0001h
SPBRG_BRG2_LENGTH                        equ 0001h
SPBRG_BRG2_MASK                          equ 0004h
SPBRG_BRG3_POSN                          equ 0003h
SPBRG_BRG3_POSITION                      equ 0003h
SPBRG_BRG3_SIZE                          equ 0001h
SPBRG_BRG3_LENGTH                        equ 0001h
SPBRG_BRG3_MASK                          equ 0008h
SPBRG_BRG4_POSN                          equ 0004h
SPBRG_BRG4_POSITION                      equ 0004h
SPBRG_BRG4_SIZE                          equ 0001h
SPBRG_BRG4_LENGTH                        equ 0001h
SPBRG_BRG4_MASK                          equ 0010h
SPBRG_BRG5_POSN                          equ 0005h
SPBRG_BRG5_POSITION                      equ 0005h
SPBRG_BRG5_SIZE                          equ 0001h
SPBRG_BRG5_LENGTH                        equ 0001h
SPBRG_BRG5_MASK                          equ 0020h
SPBRG_BRG6_POSN                          equ 0006h
SPBRG_BRG6_POSITION                      equ 0006h
SPBRG_BRG6_SIZE                          equ 0001h
SPBRG_BRG6_LENGTH                        equ 0001h
SPBRG_BRG6_MASK                          equ 0040h
SPBRG_BRG7_POSN                          equ 0007h
SPBRG_BRG7_POSITION                      equ 0007h
SPBRG_BRG7_SIZE                          equ 0001h
SPBRG_BRG7_LENGTH                        equ 0001h
SPBRG_BRG7_MASK                          equ 0080h

// Register: APFCON
#define APFCON APFCON
APFCON                                   equ 009Ch
// bitfield definitions
APFCON_CCP2SEL_POSN                      equ 0000h
APFCON_CCP2SEL_POSITION                  equ 0000h
APFCON_CCP2SEL_SIZE                      equ 0001h
APFCON_CCP2SEL_LENGTH                    equ 0001h
APFCON_CCP2SEL_MASK                      equ 0001h
APFCON_SSSEL_POSN                        equ 0001h
APFCON_SSSEL_POSITION                    equ 0001h
APFCON_SSSEL_SIZE                        equ 0001h
APFCON_SSSEL_LENGTH                      equ 0001h
APFCON_SSSEL_MASK                        equ 0002h

// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 009Dh
// bitfield definitions
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_FVREN_POSN                        equ 0006h
FVRCON_FVREN_POSITION                    equ 0006h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0040h
FVRCON_FVRRDY_POSN                       equ 0007h
FVRCON_FVRRDY_POSITION                   equ 0007h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0080h
FVRCON_FVRST_POSN                        equ 0007h
FVRCON_FVRST_POSITION                    equ 0007h
FVRCON_FVRST_SIZE                        equ 0001h
FVRCON_FVRST_LENGTH                      equ 0001h
FVRCON_FVRST_MASK                        equ 0080h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 009Fh
// bitfield definitions
ADCON1_ADREF_POSN                        equ 0000h
ADCON1_ADREF_POSITION                    equ 0000h
ADCON1_ADREF_SIZE                        equ 0002h
ADCON1_ADREF_LENGTH                      equ 0002h
ADCON1_ADREF_MASK                        equ 0003h
ADCON1_ADCS_POSN                         equ 0004h
ADCON1_ADCS_POSITION                     equ 0004h
ADCON1_ADCS_SIZE                         equ 0003h
ADCON1_ADCS_LENGTH                       equ 0003h
ADCON1_ADCS_MASK                         equ 0070h
ADCON1_ADREF0_POSN                       equ 0000h
ADCON1_ADREF0_POSITION                   equ 0000h
ADCON1_ADREF0_SIZE                       equ 0001h
ADCON1_ADREF0_LENGTH                     equ 0001h
ADCON1_ADREF0_MASK                       equ 0001h
ADCON1_ADREF1_POSN                       equ 0001h
ADCON1_ADREF1_POSITION                   equ 0001h
ADCON1_ADREF1_SIZE                       equ 0001h
ADCON1_ADREF1_LENGTH                     equ 0001h
ADCON1_ADREF1_MASK                       equ 0002h
ADCON1_ADCS0_POSN                        equ 0004h
ADCON1_ADCS0_POSITION                    equ 0004h
ADCON1_ADCS0_SIZE                        equ 0001h
ADCON1_ADCS0_LENGTH                      equ 0001h
ADCON1_ADCS0_MASK                        equ 0010h
ADCON1_ADCS1_POSN                        equ 0005h
ADCON1_ADCS1_POSITION                    equ 0005h
ADCON1_ADCS1_SIZE                        equ 0001h
ADCON1_ADCS1_LENGTH                      equ 0001h
ADCON1_ADCS1_MASK                        equ 0020h
ADCON1_ADCS2_POSN                        equ 0006h
ADCON1_ADCS2_POSITION                    equ 0006h
ADCON1_ADCS2_SIZE                        equ 0001h
ADCON1_ADCS2_LENGTH                      equ 0001h
ADCON1_ADCS2_MASK                        equ 0040h

// Register: CPSCON0
#define CPSCON0 CPSCON0
CPSCON0                                  equ 0108h
// bitfield definitions
CPSCON0_T0XCS_POSN                       equ 0000h
CPSCON0_T0XCS_POSITION                   equ 0000h
CPSCON0_T0XCS_SIZE                       equ 0001h
CPSCON0_T0XCS_LENGTH                     equ 0001h
CPSCON0_T0XCS_MASK                       equ 0001h
CPSCON0_CPSOUT_POSN                      equ 0001h
CPSCON0_CPSOUT_POSITION                  equ 0001h
CPSCON0_CPSOUT_SIZE                      equ 0001h
CPSCON0_CPSOUT_LENGTH                    equ 0001h
CPSCON0_CPSOUT_MASK                      equ 0002h
CPSCON0_CPSRNG_POSN                      equ 0002h
CPSCON0_CPSRNG_POSITION                  equ 0002h
CPSCON0_CPSRNG_SIZE                      equ 0002h
CPSCON0_CPSRNG_LENGTH                    equ 0002h
CPSCON0_CPSRNG_MASK                      equ 000Ch
CPSCON0_CPSON_POSN                       equ 0007h
CPSCON0_CPSON_POSITION                   equ 0007h
CPSCON0_CPSON_SIZE                       equ 0001h
CPSCON0_CPSON_LENGTH                     equ 0001h
CPSCON0_CPSON_MASK                       equ 0080h
CPSCON0_CPSRNG0_POSN                     equ 0002h
CPSCON0_CPSRNG0_POSITION                 equ 0002h
CPSCON0_CPSRNG0_SIZE                     equ 0001h
CPSCON0_CPSRNG0_LENGTH                   equ 0001h
CPSCON0_CPSRNG0_MASK                     equ 0004h
CPSCON0_CPSRNG1_POSN                     equ 0003h
CPSCON0_CPSRNG1_POSITION                 equ 0003h
CPSCON0_CPSRNG1_SIZE                     equ 0001h
CPSCON0_CPSRNG1_LENGTH                   equ 0001h
CPSCON0_CPSRNG1_MASK                     equ 0008h

// Register: CPSCON1
#define CPSCON1 CPSCON1
CPSCON1                                  equ 0109h
// bitfield definitions
CPSCON1_CPSCH_POSN                       equ 0000h
CPSCON1_CPSCH_POSITION                   equ 0000h
CPSCON1_CPSCH_SIZE                       equ 0004h
CPSCON1_CPSCH_LENGTH                     equ 0004h
CPSCON1_CPSCH_MASK                       equ 000Fh
CPSCON1_CPSCH0_POSN                      equ 0000h
CPSCON1_CPSCH0_POSITION                  equ 0000h
CPSCON1_CPSCH0_SIZE                      equ 0001h
CPSCON1_CPSCH0_LENGTH                    equ 0001h
CPSCON1_CPSCH0_MASK                      equ 0001h
CPSCON1_CPSCH1_POSN                      equ 0001h
CPSCON1_CPSCH1_POSITION                  equ 0001h
CPSCON1_CPSCH1_SIZE                      equ 0001h
CPSCON1_CPSCH1_LENGTH                    equ 0001h
CPSCON1_CPSCH1_MASK                      equ 0002h
CPSCON1_CPSCH2_POSN                      equ 0002h
CPSCON1_CPSCH2_POSITION                  equ 0002h
CPSCON1_CPSCH2_SIZE                      equ 0001h
CPSCON1_CPSCH2_LENGTH                    equ 0001h
CPSCON1_CPSCH2_MASK                      equ 0004h
CPSCON1_CPSCH3_POSN                      equ 0003h
CPSCON1_CPSCH3_POSITION                  equ 0003h
CPSCON1_CPSCH3_SIZE                      equ 0001h
CPSCON1_CPSCH3_LENGTH                    equ 0001h
CPSCON1_CPSCH3_MASK                      equ 0008h

// Register: PMDATL
#define PMDATL PMDATL
PMDATL                                   equ 010Ch

// Register: PMADRL
#define PMADRL PMADRL
PMADRL                                   equ 010Dh

